{"data":{"markdownRemark":{"excerpt":"“What’s for dinner?” “Umm, what’s in the fridge?” “A selection of random veges, maybe a couple of eggs.” Sound familiar? In our household…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/vege-stack-431a04f911106fc35c4434c33d50f979-51304.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 60.9%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIEAQX/xAAXAQADAQAAAAAAAAAAAAAAAAAAAQID/9oADAMBAAIQAxAAAAFE6O53EWDP/8QAGxABAAICAwAAAAAAAAAAAAAAAgADARESExT/2gAIAQEAAQUCRNRT3nNZUVI10Dj5xP/EABURAQEAAAAAAAAAAAAAAAAAAAAh/9oACAEDAQE/AYj/xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAfEAACAQMFAQAAAAAAAAAAAAAAAQISISIRMUFCgZH/2gAIAQEABj8CxgpvliwijWmn0tYW52+n/8QAGxAAAgMBAQEAAAAAAAAAAAAAAREAITFBUfD/2gAIAQEAAT8hCRpifZAXJ4nEhWDBPdNqMAO4dcLrMP/aAAwDAQACAAMAAAAQIO//xAAZEQACAwEAAAAAAAAAAAAAAAAAARFxkfD/2gAIAQMBAT8QTgU7T//EABcRAQEBAQAAAAAAAAAAAAAAAAEAEVH/2gAIAQIBAT8QdWx7f//EAB0QAQACAgIDAAAAAAAAAAAAAAEAESExQXFRYZH/2gAIAQEAAT8QGcMDfdZwIJpIDgONr8lJqFrB3TL0F7hLfF+PWpvBoWVOyPSruP/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"vege stack\"\n        title=\"\"\n        src=\"/static/vege-stack-431a04f911106fc35c4434c33d50f979-ae3ac.jpg\"\n        srcset=\"/static/vege-stack-431a04f911106fc35c4434c33d50f979-5d159.jpg 148w,\n/static/vege-stack-431a04f911106fc35c4434c33d50f979-35ab3.jpg 295w,\n/static/vege-stack-431a04f911106fc35c4434c33d50f979-ae3ac.jpg 590w,\n/static/vege-stack-431a04f911106fc35c4434c33d50f979-12342.jpg 885w,\n/static/vege-stack-431a04f911106fc35c4434c33d50f979-51304.jpg 1000w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<blockquote>\n<p><em>“What’s for dinner?”</em></p>\n<blockquote>\n<p>“Umm, what’s in the fridge?”</p>\n</blockquote>\n<p><em>“A selection of random veges, maybe a couple of eggs.”</em></p>\n</blockquote>\n<p>Sound familiar? In our household this scenario often results in grilled vegetable stacks for dinner. The recipe below is for the version I made last night but you can really play around with the ingredients depending on your tastes and what’s on hand.</p>\n<!--more-->\n<p>For a quicker option, skip or don’t salt the eggplant and cut down on the number of different vegetables used. For vegan or dairy/lactose-free versions, omit the eggs &#x26;/or fetta as appropriate.</p>\n<p>Serves 4</p>\n<ul>\n<li>1 eggplant, sliced into 5-10mm thick rounds</li>\n<li>1 sweet potato, cut into 5-10mm thick slices</li>\n<li>1 bulb garlic, cloves separated but unpeeled</li>\n<li>1 red onion, cut into 12-16 wedges (12 for a medium onion, 16 for a large onion)</li>\n<li>250g cherry tomatoes</li>\n<li>1 red capsicum, cut in half and seeds removed</li>\n<li>1 large or 2 small zucchinis, cut lengthways into 5mm thick slices (not rounds). If the zucchini is large, halve the slices.</li>\n<li>100g mushrooms, sliced</li>\n<li>Olive oil</li>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Dried basil</li>\n<li>4 eggs, hard-boiled or poached (instructions for both are below)</li>\n<li>A splash of white wine vinegar for cooking the eggs</li>\n<li>Balsamic vinegar</li>\n<li>2 cups lettuce leaves, coarsely chopped</li>\n<li>60g fetta cheese</li>\n</ul>\n<p>The first step is to cook all the vegetables, then it’s just about arranging it all on plates.</p>\n<p><strong>Eggplant:</strong> Sprinkle eggplant with salt and set aside for 30 minutes. Rinse well and pat dry with paper towel. Heat a grill or frying pan over medium heat and thinly coat with olive oil. Add eggplant and grill/fry until golden brown on the underside, about 10 minutes. Flip and repeat until golden on both sides. Remove to drain on a paper towel and repeat with any remaining slices.</p>\n<p><strong>Sweet potato, onion &#x26; garlic:</strong> Meanwhile, preheat oven to 180˚C (350 F). Brush a baking tray with olive oil and place sweet potato on the tray in a single layer. Sprinkle with salt, pepper and a little dried basil. Arrange red onion and garlic cloves around sweet potato slices. Bake until sweek potato is starting to soften, about 15 minutes. Flip sweet potato slices and return to oven. Continue to bake until sweet potato is cooked through and starting to brown, and garlic and onion are soft.</p>\n<p><strong>Capsicum &#x26; tomatoes:</strong> Brush another baking tray lightly with olive oil. Place capsicum halves on tray with the skin-side up. Add tomatoes to the tray, and bake at 180˚C until capsicum and tomato skins are blistered. I find this might normally take about 20 minutes, but is closer to 30-40 minutes if the tray is on the lower oven rack (under the sweet potato tray). Rinse the capsicum under cold water until cool enough to handle, then peel skin off and cut the flesh into slices.</p>\n<p><strong>Zucchini:</strong> Lightly coat a grill or frying pan with olive oil. Grill or fry zucchini slices over a medium heat until golden on both sides, about 15 minutes total (flip half way). Drain on paper towel.</p>\n<p><strong>Mushrooms:</strong> Heat a little olive oil in a frying pan over medium-high heat. Add the mushrooms and sauté until golden, about 10 minutes.</p>\n<p><strong>To hard-boil eggs:</strong> Place eggs in a saucepan and add enough cold water to cover completely. Adding a splash of white wine vinegar to the water will help the white set quickly in the event any of the shells crack while cooking, thus avoiding large globules of egg white leaking out. Bring to the boil over high heat, then reduce heat to medium and cook for 12 minutes. Allow eggs to cool enough to handle (cold running water helps here). Crack shell on a hard surface, peel and slice or chop.</p>\n<p><strong>To poach eggs:</strong> Heat a saucepan of water, with a dash of white wine vinegar added, over a low heat until it is barely simmering. Again, the vinegar will help the egg white set quickly, so your egg doesn’t end up in threads through the water. You don’t want the water to be bubbling vigorously or the bubbles will tear the egg apart and you’ll end up with an unattractive egg broth. Crack one egg into the saucepan, just above the water (not too high or it will break up upon hitting the water). Cook for 3 minutes (I use the timer on my phone). Remove egg with a slotted spoon and allow to drain. Repeat for remaining eggs. You can reuse the water, but I generally fish out any bits of egg white left in the water between eggs.</p>\n<p><strong>Assembly:</strong> Spread lettuce leaves on dinner plates. Arrange grilled vegetables in layers to form a stack on each plate, starting with the large flat slices, like the eggplant and sweet potato at the bottom, and distributing rounder vegetables, like the tomatoes and garlic, around the edge of the stack. Top each stack with an egg season with salt and pepper to taste. Finally, crumble fetta over the top, drizzle with a little balsamic vinegar and serve.</p>","frontmatter":{"title":"Grilled vegetable stacks","date":"March 30, 2013","tags":["Dairy/lactose-free friendly","Eggs","Nut-free friendly","Quick & easy","Vegan friendly","Vegetarian"]}}},"pageContext":{"slug":"/2013/03/30/2013-3-30-grilled-vegetable-stacks/","previous":{"fields":{"slug":"/2013/03/30/2013-3-30-banana-almond-and-coconut-pancakes/"},"frontmatter":{"title":"Banana, almond and coconut pancakes","tags":["Breakfast & brunch","Dairy/lactose-free friendly","Eggs","Quick & easy","Vegetarian"]}},"next":{"fields":{"slug":"/2013/04/01/2013-3-30-chickpea-tagine-with-morrocan-quinoa-pilaf/"},"frontmatter":{"title":"Chickpea tagine with Moroccan quinoa pilaf","tags":["Dairy/lactose-free friendly","Legumes","Vegan friendly","Vegetarian"]}}}}